In [1]:
import pandas as pd

In [2]:
from pandas import DataFrame

# Series

In [3]:
ser1 = pd.Series([1, 2, 3, 4], index = ['USA', 'Germany', 'USSR', 'Japan'])

In [4]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [5]:
ser2 = pd.Series([1, 2, 5, 4], index = ['USA', 'Germany', 'Italy', 'Japan'])

In [6]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [7]:
pd.__version__

'0.25.1'

In [8]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [9]:
a = [1, 2, 3, 4, 5]
b = [x for x in range(10)]

a + b

[1, 2, 3, 4, 5, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [10]:
ser3  = ser1 + ser2
ser3.fillna(3, inplace = True)
ser3

Germany    4.0
Italy      3.0
Japan      8.0
USA        2.0
USSR       3.0
dtype: float64

In [11]:
ser3.Italy

3.0

In [12]:
ser3.Italy = 5

In [13]:
ser3

Germany    4.0
Italy      5.0
Japan      8.0
USA        2.0
USSR       3.0
dtype: float64

In [14]:
ser3[1:4]

Italy    5.0
Japan    8.0
USA      2.0
dtype: float64

In [15]:
ser3['USSR'] = 3

In [16]:
ser3

Germany    4.0
Italy      5.0
Japan      8.0
USA        2.0
USSR       3.0
dtype: float64

# DataFrames

In [17]:
a = [x for x in range(10)]
b = [x for x in range(10)]
c = [x for x in range(10)]

In [18]:
ndarray = []

ndarray.append(a)
ndarray.append(b)
ndarray.append(c)
ndarray

[[0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
 [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
 [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]]

In [19]:
for elements in ndarray:
    print('Elements - ', elements)
    for element in elements:
        print('Element - ', element) #итое джитое

Elements -  [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
Element -  0
Element -  1
Element -  2
Element -  3
Element -  4
Element -  5
Element -  6
Element -  7
Element -  8
Element -  9
Elements -  [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
Element -  0
Element -  1
Element -  2
Element -  3
Element -  4
Element -  5
Element -  6
Element -  7
Element -  8
Element -  9
Elements -  [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
Element -  0
Element -  1
Element -  2
Element -  3
Element -  4
Element -  5
Element -  6
Element -  7
Element -  8
Element -  9

# DataFrames

In [20]:
import pandas as pd
import numpy as np

In [21]:
from numpy.random import randn
np.random.seed(101)

In [22]:
'A B C D E'.split()

['A', 'B', 'C', 'D', 'E']

In [23]:
randn(4, 4)

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651]])

In [24]:
np.random.randint(1,10)

8

In [25]:
df = pd.DataFrame(randn(4, 4), index = ["Petya", "Kolya", "Masha", "Sasha"], columns = ["A", "B", "C", "D"])

In [26]:
df

              A         B         C         D
Petya  2.605967  0.683509  0.302665  1.693723
Kolya -1.706086 -1.159119 -0.134841  0.390528
Masha  0.166905  0.184502  0.807706  0.072960
Sasha  0.638787  0.329646 -0.497104 -0.754070

In [27]:
type(df)

pandas.core.frame.DataFrame

In [28]:
df[['A', 'B']]

              A         B
Petya  2.605967  0.683509
Kolya -1.706086 -1.159119
Masha  0.166905  0.184502
Sasha  0.638787  0.329646

In [29]:
df['new'] = df["A"] + df["B"]
df['new2'] = [1, 2, 3, 4]
df['new3'] = [None, None, None, None]
df['new4'] = df['B']*30/100

In [30]:
df

              A         B         C         D       new  new2  new3      new4
Petya  2.605967  0.683509  0.302665  1.693723  3.289476     1  None  0.205053
Kolya -1.706086 -1.159119 -0.134841  0.390528 -2.865205     2  None -0.347736
Masha  0.166905  0.184502  0.807706  0.072960  0.351406     3  None  0.055351
Sasha  0.638787  0.329646 -0.497104 -0.754070  0.968433     4  None  0.098894

In [31]:
df.drop('C', axis = 1, inplace = True)

In [32]:
df.drop('new', axis = 1, inplace = True)

In [33]:
df

              A         B         D  new2  new3      new4
Petya  2.605967  0.683509  1.693723     1  None  0.205053
Kolya -1.706086 -1.159119  0.390528     2  None -0.347736
Masha  0.166905  0.184502  0.072960     3  None  0.055351
Sasha  0.638787  0.329646 -0.754070     4  None  0.098894

In [63]:
#df.loc[['Petya'], ['C']]

In [35]:
a = [1, 2, 3, 4, 5, 6 ,7 , 8, 9, 10]
a[5:-1]

[6, 7, 8, 9]

In [36]:
df

              A         B         D  new2  new3      new4
Petya  2.605967  0.683509  1.693723     1  None  0.205053
Kolya -1.706086 -1.159119  0.390528     2  None -0.347736
Masha  0.166905  0.184502  0.072960     3  None  0.055351
Sasha  0.638787  0.329646 -0.754070     4  None  0.098894

In [37]:
df.iloc[1:, -3:-1]

       new2  new3
Kolya     2  None
Masha     3  None
Sasha     4  None

In [38]:
df['new4'] = df['A'] + df['B']

In [39]:
df

              A         B         D  new2  new3      new4
Petya  2.605967  0.683509  1.693723     1  None  3.289476
Kolya -1.706086 -1.159119  0.390528     2  None -2.865205
Masha  0.166905  0.184502  0.072960     3  None  0.351406
Sasha  0.638787  0.329646 -0.754070     4  None  0.968433

In [40]:
df[(df['A'] > 0) & (df['D'] < 0)]

              A         B        D  new2  new3      new4
Sasha  0.638787  0.329646 -0.75407     4  None  0.968433

In [41]:
df.head()

              A         B         D  new2  new3      new4
Petya  2.605967  0.683509  1.693723     1  None  3.289476
Kolya -1.706086 -1.159119  0.390528     2  None -2.865205
Masha  0.166905  0.184502  0.072960     3  None  0.351406
Sasha  0.638787  0.329646 -0.754070     4  None  0.968433

In [44]:
df["shop"] = ['shop1', 'shop2', 'shop3', 'shop4']

In [47]:
df.set_index('shop')

              A         B         D  new2  new3      new4
shop
shop1  2.605967  0.683509  1.693723     1  None  3.289476
shop2 -1.706086 -1.159119  0.390528     2  None -2.865205
shop3  0.166905  0.184502  0.072960     3  None  0.351406
shop4  0.638787  0.329646 -0.754070     4  None  0.968433

In [50]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 1, 2, 3]
hier_index = list(zip(outside, inside))
hier_index2 = pd.MultiIndex.from_tuples(hier_index)
list(zip(outside, inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [51]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [53]:
hier_index2

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [52]:
df = pd.DataFrame(np.random.randn(6,2), index = hier_index2, columns = ['A', 'B'])
df

             A         B
G1 1 -0.031579  0.649826
   2  2.154846 -0.610259
   3 -0.755325 -0.346419
G2 1  0.147027 -0.479448
   2  0.558769  1.024810
   3 -0.925874  1.862864

In [54]:
df.loc['G1']

          A         B
1 -0.031579  0.649826
2  2.154846 -0.610259
3 -0.755325 -0.346419

In [55]:
df.loc['G1'].loc[1]

A   -0.031579
B    0.649826
Name: 1, dtype: float64

In [58]:
df.xs(['G2', 1])          fro multiindex обращений

A    0.147027
B   -0.479448
Name: (G2, 1), dtype: float64

In [ ]:
df.xs('G1', level = 'Cassa')

# missing values

In [ ]:
df = pd.DataFrame{
    'A'
    'B'
    'C'
}

In [59]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350],
       'Sales2':[2005,120,340,1234,243,350]}

In [60]:
df = pd.DataFrame(data)

In [62]:
df.sort_values('Sales')

  Company   Person  Sales  Sales2
1    GOOG  Charlie    120     120
3    MSFT  Vanessa    124    1234
0    GOOG      Sam    200    2005
4      FB     Carl    243     243
2    MSFT      Amy    340     340
5      FB    Sarah    350     350